TVC-Hopper/tvc-hopper/bsp/mimxrt1010-evk/src/pin_mux.c
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v12.0
processor: MIMXRT1011xxxxx
package_id: MIMXRT1011DAE5A
mcu_data: ksdk2_0
processor_version: 12.0.1
board: MIMXRT1010-EVK
expansion_headers:
- id: frdm_arduino
  name: IMXRT Expansion Header
  connectors:
  - id: C1
    name: J60
    pins:
    - {id: 1, name: GND, external_signal_types: ground}
    - {id: 3, name: GND, external_signal_types: ground}
    - {id: 4, name: 3.3V, external_signal_types: power_supply_3.3V}
    - {id: 5, pin_num: '8', pin_signal: GPIO_05}
    - {id: 6, name: RESET, pin_num: '22', pin_signal: POR_B}
    - {id: 7, pin_num: '6', pin_signal: GPIO_06}
    - {id: 8, name: 3.3V, external_signal_types: power_supply_3.3V}
    - {id: 9, pin_num: '10', pin_signal: GPIO_03}
    - {id: 10, name: 5V, external_signal_types: power_supply_5V}
    - {id: 12, name: GND, external_signal_types: ground}
    - {id: 14, name: GND, external_signal_types: ground}
    - {id: 16, name: 5V, external_signal_types: power_supply_5V}
  - id: C2
    name: J57
    pins:
    - {id: 2, name: D8, pin_num: '74', pin_signal: GPIO_SD_02}
    - {id: 6, name: D10, pin_num: '55', pin_signal: GPIO_AD_05}
    - {id: 8, name: D11, pin_num: '56', pin_signal: GPIO_AD_04}
    - {id: 10, name: D12, pin_num: '57', pin_signal: GPIO_AD_03}
    - {id: 12, name: D13, pin_num: '52', pin_signal: GPIO_AD_06}
    - {id: 14, name: GND, external_signal_types: ground}
    - {id: 16, name: AREF, external_signal_types: aref}
    - {id: 18, name: D14, pin_num: '12', pin_signal: GPIO_01}
    - {id: 20, name: D15, pin_num: '11', pin_signal: GPIO_02}
  - id: C3
    name: J56
    pins:
    - {id: 2, name: D0, pin_num: '3', pin_signal: GPIO_09}
    - {id: 4, name: D1, pin_num: '2', pin_signal: GPIO_10}
    - {id: 6, name: D2, pin_num: '55', pin_signal: GPIO_AD_05}
    - {id: 8, name: D3, pin_num: '52', pin_signal: GPIO_AD_06}
    - {id: 10, pin_num: '52', pin_signal: GPIO_AD_06}
    - {id: 14, name: D6, pin_num: '59', pin_signal: GPIO_AD_01}
    - {id: 16, name: D7, pin_num: '58', pin_signal: GPIO_AD_02}
  - id: C4
    name: J26
    pins:
    - {id: 2, name: A0, pin_num: '51', pin_signal: GPIO_AD_07}
    - {id: 4, name: A1, pin_num: '48', pin_signal: GPIO_AD_09}
    - {id: 6, name: A2, pin_num: '47', pin_signal: GPIO_AD_10}
    - {id: 8, name: A3, pin_num: '43', pin_signal: GPIO_AD_14}
    - {id: 10, name: A4, pin_num: '59', pin_signal: GPIO_AD_01}
    - {id: 12, name: A5, pin_num: '58', pin_signal: GPIO_AD_02}
pin_labels:
- {pin_num: '58', pin_signal: GPIO_AD_02, label: 'ADC12_2/J26[12]/J56[16]', identifier: ADC12_2;IMU_INT0}
- {pin_num: '57', pin_signal: GPIO_AD_03, label: 'LPSPI1_SDI/J57[10]/U27[2]', identifier: LPSPI1_SDI;PWM1_B_2}
- {pin_num: '56', pin_signal: GPIO_AD_04, label: 'LPSPI1_SDO/J57[8]/U27[5]', identifier: LPSPI1_SDO;PWM_A_2;PWM1_A_2}
- {pin_num: '55', pin_signal: GPIO_AD_05, label: 'LPSPI1_PCS0/INT1_COMBO/J56[6]/J57[6]/U26[11]/U27[1]', identifier: LPSPI1_PCS0;PWM1_B_3}
- {pin_num: '52', pin_signal: GPIO_AD_06, label: 'LPSPI1_SCK/INT2_COMBO/J56[8]/J57[12]/U26[9]/U27[6]', identifier: LPSPI1_SCK;PWM1_A_3}
- {pin_num: '51', pin_signal: GPIO_AD_07, label: 'SAI1_TX_SYNC/U10[13]', identifier: ADC12_3}
- {pin_num: '43', pin_signal: GPIO_AD_14, label: 'ADC12_6/J26[8]', identifier: ADC12_6;IMU_INT1}
- {pin_num: '74', pin_signal: GPIO_SD_02, label: 'GPIO_SD_02/BT_CFG[0]/J57[2]/TP34', identifier: GPIO_SD_02;PWM1_A_0}
power_domains: {NVCC_GPIO: '3.3'}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_xbara.h"
#include "fsl_iomuxc.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    BOARD_InitPins();
    BOARD_InitDEBUG_UARTPins();
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true', fullInit: 'true'}
- pin_list:
  - {pin_num: '11', peripheral: LPI2C1, signal: SCL, pin_signal: GPIO_02, slew_rate: Slow, software_input_on: Disable, open_drain: Disable, speed: MHZ_100, drive_strength: R0_4,
    pull_keeper_select: Keeper, pull_keeper_enable: Enable, pull_up_down_config: Pull_Down_100K_Ohm, hysteresis_enable: Disable}
  - {pin_num: '12', peripheral: LPI2C1, signal: SDA, pin_signal: GPIO_01, identifier: '', slew_rate: Slow, software_input_on: Disable, open_drain: Disable, speed: MHZ_100,
    drive_strength: R0_4, pull_keeper_select: Keeper, pull_keeper_enable: Enable, pull_up_down_config: Pull_Down_100K_Ohm, hysteresis_enable: Disable}
  - {pin_num: '51', peripheral: PWM1, signal: 'FAULT, 3', pin_signal: GPIO_AD_07, identifier: '', slew_rate: Slow, software_input_on: Disable, open_drain: Disable,
    speed: MHZ_100, drive_strength: R0_4, pull_keeper_select: Keeper, pull_keeper_enable: Enable, pull_up_down_config: Pull_Down_100K_Ohm, hysteresis_enable: Disable}
  - {pin_num: '51', peripheral: PWM1, signal: 'FAULT, 2', pin_signal: GPIO_AD_07, identifier: '', slew_rate: Slow, software_input_on: Disable, open_drain: Disable,
    speed: MHZ_100, drive_strength: R0_4, pull_keeper_select: Keeper, pull_keeper_enable: Enable, pull_up_down_config: Pull_Down_100K_Ohm, hysteresis_enable: Disable}
  - {pin_num: '51', peripheral: PWM1, signal: 'FAULT, 1', pin_signal: GPIO_AD_07, identifier: '', slew_rate: Slow, software_input_on: Disable, open_drain: Disable,
    speed: MHZ_100, drive_strength: R0_4, pull_keeper_select: Keeper, pull_keeper_enable: Enable, pull_up_down_config: Pull_Down_100K_Ohm, hysteresis_enable: Disable}
  - {pin_num: '10', peripheral: PWM1, signal: 'B, 1', pin_signal: GPIO_03, direction: OUTPUT, slew_rate: Slow, software_input_on: Disable, open_drain: Disable, speed: MHZ_100,
    drive_strength: R0_4, pull_keeper_select: Keeper, pull_keeper_enable: Enable, pull_up_down_config: Pull_Down_100K_Ohm, hysteresis_enable: Disable}
  - {pin_num: '6', peripheral: PWM1, signal: 'A, 2', pin_signal: GPIO_06, direction: OUTPUT, slew_rate: Slow, software_input_on: Disable, open_drain: Disable, speed: MHZ_100,
    drive_strength: R0_4, pull_keeper_select: Keeper, pull_keeper_enable: Enable, pull_up_down_config: Pull_Down_100K_Ohm, hysteresis_enable: Disable}
  - {pin_num: '8', peripheral: PWM1, signal: 'B, 2', pin_signal: GPIO_05, direction: OUTPUT, slew_rate: Slow, software_input_on: Disable, open_drain: Disable, speed: MHZ_100,
    drive_strength: R0_4, pull_keeper_select: Keeper, pull_keeper_enable: Enable, pull_up_down_config: Pull_Down_100K_Ohm, hysteresis_enable: Disable}
  - {pin_num: '51', peripheral: PWM1, signal: 'FAULT, 0', pin_signal: GPIO_AD_07, slew_rate: Slow, software_input_on: Disable, open_drain: Disable, speed: MHZ_100,
    drive_strength: R0_4, pull_keeper_select: Keeper, pull_keeper_enable: Enable, pull_up_down_config: Pull_Down_100K_Ohm, hysteresis_enable: Disable}
  - {pin_num: '49', peripheral: JTAG, signal: TRSTB, pin_signal: GPIO_AD_08, slew_rate: Slow, software_input_on: Disable, open_drain: Disable, speed: MHZ_100, drive_strength: R0_4,
    pull_keeper_select: Pull, pull_keeper_enable: Enable, pull_up_down_config: Pull_Up_47K_Ohm, hysteresis_enable: Disable}
  - {pin_num: '44', peripheral: JTAG, signal: TMS, pin_signal: GPIO_AD_13, slew_rate: Slow, software_input_on: Disable, open_drain: Disable, speed: MHZ_100, drive_strength: R0_4,
    pull_keeper_select: Pull, pull_keeper_enable: Enable, pull_up_down_config: Pull_Up_47K_Ohm, hysteresis_enable: Disable}
  - {pin_num: '48', peripheral: JTAG, signal: TDO, pin_signal: GPIO_AD_09, slew_rate: Fast, software_input_on: Disable, open_drain: Disable, speed: MHZ_100, drive_strength: R0_6,
    pull_keeper_select: Keeper, pull_keeper_enable: Enable, pull_up_down_config: Pull_Up_100K_Ohm, hysteresis_enable: Disable}
  - {pin_num: '47', peripheral: JTAG, signal: TDI, pin_signal: GPIO_AD_10, slew_rate: Slow, software_input_on: Disable, open_drain: Disable, speed: MHZ_100, drive_strength: R0_4,
    pull_keeper_select: Pull, pull_keeper_enable: Enable, pull_up_down_config: Pull_Up_47K_Ohm, hysteresis_enable: Disable}
  - {pin_num: '45', peripheral: JTAG, signal: TCK, pin_signal: GPIO_AD_12, slew_rate: Slow, software_input_on: Disable, open_drain: Disable, speed: MHZ_100, drive_strength: R0_4,
    pull_keeper_select: Pull, pull_keeper_enable: Enable, pull_up_down_config: Pull_Down_100K_Ohm, hysteresis_enable: Disable}
  - {pin_num: '58', peripheral: GPIO1, signal: 'gpiomux_io, 16', pin_signal: GPIO_AD_02, identifier: IMU_INT0, direction: INPUT, gpio_interrupt: kGPIO_NoIntmode,
    slew_rate: Slow, software_input_on: Disable, open_drain: Disable, speed: MHZ_100, drive_strength: R0_4, pull_keeper_select: Keeper, pull_keeper_enable: Enable,
    pull_up_down_config: Pull_Down_100K_Ohm, hysteresis_enable: Disable}
  - {pin_num: '43', peripheral: GPIO1, signal: 'gpiomux_io, 28', pin_signal: GPIO_AD_14, identifier: IMU_INT1, direction: INPUT, gpio_interrupt: kGPIO_NoIntmode,
    slew_rate: Slow, software_input_on: Disable, open_drain: Disable, speed: MHZ_100, drive_strength: R0_4, pull_keeper_select: Keeper, pull_keeper_enable: Enable,
    pull_up_down_config: Pull_Down_100K_Ohm, hysteresis_enable: Disable}
  - {pin_num: '55', peripheral: PWM1, signal: 'B, 3', pin_signal: GPIO_AD_05, identifier: PWM1_B_3, direction: OUTPUT, slew_rate: Slow, software_input_on: Disable,
    open_drain: Disable, speed: MHZ_100, drive_strength: R0_4, pull_keeper_select: Keeper, pull_keeper_enable: Enable, pull_up_down_config: Pull_Down_100K_Ohm, hysteresis_enable: Disable}
  - {pin_num: '52', peripheral: PWM1, signal: 'A, 3', pin_signal: GPIO_AD_06, identifier: PWM1_A_3, direction: OUTPUT, slew_rate: Slow, software_input_on: Disable,
    open_drain: Disable, speed: MHZ_100, drive_strength: R0_4, pull_keeper_select: Keeper, pull_keeper_enable: Enable, pull_up_down_config: Pull_Down_100K_Ohm, hysteresis_enable: Disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

